def clean(x):
    uni = ('à','á','ả','ã','ạ','â','ầ','ấ','ẩ','ẫ','ậ','ă','ằ','ắ','ẳ','ẵ','ặ','è','é','ẻ','ẽ','ẹ','ê','ề','ế','ể','ễ','ệ','đ','ì','í','ỉ','ĩ','ị','ò','ó','ỏ','õ','ọ','ô','ồ','ố','ổ','ỗ','ộ','ơ','ờ','ớ','ở','ỡ','ợ','ù','ú','ủ','ũ','ụ','ư','ừ','ứ','ử','ữ','ự','ỳ','ý','ỷ','ỹ')
    t = ''
    for c in x:
        if ('a'<=c and c<='z') or ('A'<=c and c<='Z') or ('0'<=c and c<='9') or (c=='@') or (c in uni): t+=c
    return t

print(clean('Trừ mèo méo meo ra thì ai c$&^%&@ũng được :))))'))